public class Lesson18 {
    public static void main(String[] args) {
        Товар[] товарыArray = new Товар[5];
        товарыArray[0] = new Товар();
        товарыArray[0].название = "Ноутбук Lenovo";
        товарыArray[0].датаПроизводства = "24.05.2024";
        товарыArray[0].производитель = "Legend Group";
        товарыArray[0].странаПроисхождения = "China";
        товарыArray[0].цена = 29900.0;
        товарыArray[0].забронированПокупателем = true;
        товарыArray[1] = new Товар();
        товарыArray[1].название = "Samsung S25 Ultra";
        товарыArray[1].датаПроизводства = "01.05.2024";
        товарыArray[1].производитель = "amsung Corp";
        товарыArray[1].странаПроисхождения = "Korea";
        товарыArray[1].цена = 59900.0;
        товарыArray[1].забронированПокупателем = true;
        товарыArray[2] = new Товар();
        товарыArray[2].название = "Apple iPhone 16";
        товарыArray[2].датаПроизводства = "11.05.2025";
        товарыArray[2].производитель = "Apple Inc";
        товарыArray[2].странаПроисхождения = "USA";
        товарыArray[2].цена = 89900.0;
        товарыArray[2].забронированПокупателем = true;
        товарыArray[3] = new Товар();
        товарыArray[3].название = "Xiaomi 14T Pro";
        товарыArray[3].датаПроизводства = "18.05.2025";
        товарыArray[3].производитель = "Xiaomi Inc";
        товарыArray[3].странаПроисхождения = "China";
        товарыArray[3].цена = 39900.0;
        товарыArray[3].забронированПокупателем = true;
        товарыArray[4] = new Товар();
        товарыArray[4].название = "Google Pixel 9";
        товарыArray[4].датаПроизводства = "30.09.2025";
        товарыArray[4].производитель = "Google LLC";
        товарыArray[4].странаПроисхождения = "USA";
        товарыArray[4].цена = 64900.0;
        товарыArray[4].забронированПокупателем = false;
        for (int i = 0; i < товарыArray.length; i++) {
            if (товарыArray[i] != null) {
                System.out.println("Товар №" + (i + 1) + ":");
                товарыArray[i].вывестиИнформацию();
            }
        }
    }
}