public class Lesson24 {
    public static void main(String[] args) {
        Product1 товар1 = new Product1();
        товар1.название = "Ноутбук Lenovo";
        товар1.датаПроизводства = "24.05.2024";
        товар1.производитель = "Legend Group";
        товар1.странаПроисхождения = "Китай";
        товар1.цена = 29900.0;
        товар1.забронированПокупателем = true;
        System.out.println("товар1 название: " + товар1.название);
        System.out.println("товар1 дата производства: " + товар1.датаПроизводства);
        System.out.println("товар1 производитель: " + товар1.производитель);
        System.out.println("товар1 страна происхождения: " + товар1.странаПроисхождения);
        System.out.println("товар1 цена: " + товар1.цена);
        System.out.println("товар1 забронирован покупателем: " + товар1.забронированПокупателем);
    }
}
