public class Lesson37 {
        public static void main(String[] args) {
            PhoneDirectory справочник = new PhoneDirectory();
            справочник.add("Иванов", "8-927-123-45-67");
            справочник.add("Петров", "8-987-654-32-10");
            справочник.add("Сидоров", "8-905-345-67-89");
            справочник.add("Иванов", "8-902-800-11-22");
            справочник.add("Петров", "8-937-555-44-33");
            System.out.println("Номера для Иванова: " + справочник.get("Иванов"));
            System.out.println("Номера для Петрова: " + справочник.get("Петров"));
            System.out.println("Номера для Сидорова: " + справочник.get("Сидоров"));
            System.out.println("Номера для Козлова: " + справочник.get("Козлов")); // Фамилия отсутствует
        }
    }